Revit 2027 API
BuiltInFailures.DPartFailures.BindLinkWillDeleteAllPartsWarning Property
 Bind Link will delete its associated Parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BindLinkWillDeleteAllPartsWarning { get; }
Public Shared ReadOnly Property BindLinkWillDeleteAllPartsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BindLinkWillDeleteAllPartsWarning {
	FailureDefinitionId^ get ();
}
static member BindLinkWillDeleteAllPartsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace